{
	"name": "Reverse Words",
	"tag": "reverse_words",
	"weights": {
		"dev": 1.0,
		"spd": 0.5,
		"mem": 3.0
	},
	"description": "<p>Reverse the space-separated words in a string and print them out.</p>",
	"sample": {
		"test_cases": [
			"Reverse the space-separated words in a string and print them out.",
			"great! is AdHarmonics for Working"
		],
		"solutions": [
			"out. them print and string a in words space-separated the Reverse",
			"Working for AdHarmonics is great!"
		]
	},
	"official": {
		"test_cases": [
			"Reverse the space-separated words in a string and print them out.",
			"great! is AdHarmonics for Working",
			"Alturas estima red norland cabritas russet norkotah up to date linda. Spud bildtstar blue congo alturas snowden russet burbank. Irish cobbler kestrel bannock russet megachip, selma nicola golden wonder blue congo kerr's pink apline. Almond german butterball kipfler megachip bonnotte tater. Monalisa marcy bintje kerr's pink blazer russet. Superior cara, record atlantic home guard russet burbank cara marcy. Bonnotte primura marfona langlade king edward, shepody megachip norgold russet estima pike russet burbank. Bildtstar almond king edward apline linda silverton russet irish cobbler. Tater yellow finn vivaldi anya megachip monalisa bonnotte. Arran victory cielo, agata ranger russet lady balfour red lasoda irish cobbler yellow finn home guard. Record fingerling irish cobbler nicola flava. Russet burbank maris piper nicola, sirco cara kestrel bintje red lasoda maris piper chelina. Russet burbank nicola adirondack red linda kennebec flava chelina. Shepody snowden bamberg stobrawa agata bonnotte spud, chelina clavela blanca carola kennebec cara. Blazer russet tots lady balfour bildtstar, avalanche cabritas record carola clavela blanca vivaldi russet norkotah. Langlade adirondack red marcy selma vivaldi canela russet potato. Red lasoda superior russet norkotah, annabelle silverton russet cara adirondack blue estima pink fir apple alturas. Innovator ranger russet blazer russet arran victory avalanche. Marcy home guard megachip bonnotte cara pink eye. Pink eye monalisa, blue congo british queens lady balfour kerr's pink king edward pink fir apple. Anya superior stobrawa german butterball estima belle de fontenay. Fingerling spud keuka gold estima record red pontiac. Flava canela russet russet norkotah pink eye avalanche record. Carola linda pink fir apple home guard primura ratte. Home guard spud ratte selma langlade german butterball. Ratte pink eye, pink fir apple marfona arran victory camota up to date blue congo. Primura almond blue congo irish cobbler canela russet selma. Fianna cabritas camota fingerling jersey royal nicola. Ratte kipfler, marfona avalanche king edward fingerling silverton russet. Ranger russet red pontiac russet burbank french fries pink fir apple ratte. Yellow finn rooster avalanche red lasoda almond. Russet burbank annabelle sieglinde, amandine bintje spunta camota bannock russet. Almond bildtstar selma sirco norgold russet kipfler. Estima blazer russet kestrel canela russet sieglinde. Bonnotte amandine blazer russet selma apline bintje canela russet. Jersey royal canela russet bildtstar monalisa golden wonder irish cobbler. Tots home guard atlantic golden wonder alturas, nicola kestrel british queens maris piper bonnotte jersey royal. Russet norkotah, monalisa avalanche carola camota red norland. Marfona keuka gold blazer russet nicola rooster cara. Marquis chelina russet burbank, silverton russet innovator record kipfler russet norkotah. Kennebec german butterball red lasoda russet norkotah blazer russet. Adirondack blue belle de fontenay pike golden wonder cielo. Lady balfour maris piper red pontiac shepody avalanche. Marfona russet norkotah golden wonder amandine red pontiac adirondack blue belle de fontenay. Annabelle bintje keuka gold vitelotte linda. British queens cielo spunta snowden cabritas belle de fontenay, selma bonnotte silverton russet adirondack blue pike. Goldrush silverton russet, vitelotte bintje russet burbank anya bamberg kennebec keuka gold. Pink fir apple spunta anya amandine, red lasoda estima yukon gold marcy flava tots. Blazer russet bannock russet innovator belle de fontenay red norland tater. Kennebec record british queens belle de fontenay pink eye avalanche. Irish cobbler apline vitelotte alturas, ratte king edward chelina yukon gold canela russet french fries. Carola, kipfler linda silverton russet estima almond red norland. Superior ratte rooster pink fir apple cielo. Monalisa carola primura russet norkotah adirondack blue british queens russet burbank. Arran victory megachip keuka gold sirco, spunta kerr's pink cara alturas avalanche ratte. Anya ratte camota cabritas kipfler, primura blazer russet amandine atlantic red lasoda kestrel langlade. Superior potato linda adirondack red cara tots. Langlade record rooster estima bannock russet snowden. Belle de fontenay, avalanche french fries red pontiac linda up to date. Amandine kestrel rooster tater, maris piper keuka gold annabelle german butterball sirco. Yukon gold norgold russet russet burbank potato marfona silverton russet kerr's pink. Silverton russet bildtstar arran victory german butterball carola, golden wonder canela russet fianna jersey royal pink eye. Annabelle silverton russet sirco kestrel estima superior. Annabelle french fries, norgold russet monalisa silverton russet shepody avalanche bamberg. Lady balfour atlantic blue congo silverton russet pike. Annabelle spud marfona cabritas german butterball keuka gold. Spud blazer russet flava, adirondack blue anya marcy annabelle blazer russet yellow finn flava. Blue congo adirondack blue rooster amandine, camota home guard kerr's pink alturas red pontiac. Selma bintje primura pink fir apple innovator tots. Adirondack red yukon gold maris piper bannock russet red pontiac agata. Norgold russet bonnotte silverton russet golden wonder german butterball bintje. Carola agata, cara anya rooster king edward bamberg apline. Red lasoda kennebec red norland avalanche fingerling, cabritas vitelotte camota bannock russet kerr's pink. Red pontiac almond arran victory fingerling british queens. British queens snowden adirondack red primura belle de fontenay record, annabelle primura pike linda german butterball. Golden wonder norgold russet clavela blanca megachip marfona avalanche lady balfour. Belle de fontenay linda french fries cabritas blazer russet, pike russet burbank apline lady balfour goldrush potato. Sieglinde fingerling belle de fontenay irish cobbler bamberg canela russet. Vivaldi almond vitelotte, cara cabritas king edward bildtstar atlantic. Bamberg bannock russet innovator golden wonder agata avalanche pink eye. Cara pink eye spud ratte bamberg king edward. Norgold russet stobrawa spud kennebec, apline spud tater arran victory rooster amandine belle de fontenay. Amandine cabritas german butterball french fries golden wonder record, bannock russet marcy cabritas king edward carola kestrel. Red lasoda cielo kipfler blazer russet bintje, snowden bildtstar french fries selma british queens bamberg marcy. Langlade megachip red lasoda yellow finn spunta arran victory. Yellow finn cielo kipfler marfona potato. Ratte canela russet pike linda cara maris piper, yellow finn pink eye shepody german butterball stobrawa atlantic. Pink eye kennebec potato lady balfour kipfler. Alturas rooster adirondack red adirondack blue ranger russet blue congo. Potato fingerling camota record, monalisa french fries bannock russet adirondack red camota. Red lasoda selma linda yukon gold pike arran victory belle de fontenay. Spud pike sieglinde bannock russet cabritas, bintje primura bonnotte innovator ranger russet british queens. Stobrawa irish cobbler pink fir apple vivaldi bildtstar british queens selma, ratte megachip kestrel goldrush selma blue congo. Irish cobbler king edward tots agata amandine bonnotte. Langlade bildtstar amandine yellow finn blazer russet. Yellow finn carola jersey royal, red lasoda kerr's pink potato spud bamberg bonnotte ratte. Up to date yellow finn cielo fingerling russet norkotah russet burbank, tots marquis blue congo bamberg camota. Cielo silverton russet cabritas blazer russet pink fir apple, selma almond king edward camota kerr's pink red pontiac. Tater blazer russet spunta red norland marcy estima linda, yellow finn spud chelina sirco arran victory german butterball vitelotte. German butterball tots keuka gold fingerling belle de fontenay russet burbank. Yellow finn monalisa bonnotte, anya maris piper german butterball linda clavela blanca record innovator. Belle de fontenay vivaldi tots, russet norkotah potato pink fir apple adirondack red cielo. Vivaldi vitelotte pike, monalisa pink fir apple adirondack blue fianna nicola atlantic primura. Kestrel fianna anya pike annabelle keuka gold. Sieglinde vitelotte maris piper amandine marquis camota kennebec. Adirondack red kennebec home guard king edward amandine, pink eye flava sieglinde monalisa cielo ranger russet. Potato irish cobbler sirco carola superior. Marcy blue congo british queens king edward pink eye. Norgold russet marcy blue congo clavela blanca pink fir apple camota french fries. Blazer russet kestrel superior blue congo tots amandine, kestrel blue congo golden wonder maris piper red norland flava. Jersey royal atlantic russet norkotah shepody arran victory adirondack red bildtstar. Agata blue congo cabritas annabelle arran victory yellow finn, linda belle de fontenay flava bonnotte russet burbank. Potato record up to date blazer russet nicola megachip. Nicola russet norkotah british queens tater ratte vitelotte norgold russet. Bamberg chelina fianna kerr's pink nicola bildtstar. Vitelotte potato annabelle clavela blanca arran victory atlantic. Red lasoda marquis bintje pink eye blue congo superior. Pink eye monalisa adirondack red keuka gold clavela blanca bonnotte. Arran victory spunta red norland ranger russet kerr's pink, blue congo marcy marquis shepody pike home guard. Yellow finn superior norgold russet flava record. Estima cara, primura annabelle king edward french fries shepody chelina. Kipfler flava marcy anya yukon gold, german butterball ratte fingerling adirondack blue potato carola goldrush. Marquis home guard selma golden wonder almond atlantic. German butterball almond up to date fianna ranger russet vitelotte. Goldrush british queens anya annabelle belle de fontenay innovator fianna. Linda cara blazer russet golden wonder nicola, bintje french fries russet norkotah arran victory vitelotte tater ratte. Innovator pink fir apple monalisa spunta ratte."

		],
		"solutions": [
			"out. them print and string a in words space-separated the Reverse",
			"Working for AdHarmonics is great!",
			"ratte. spunta monalisa apple fir pink Innovator ratte. tater vitelotte victory arran norkotah russet fries french bintje nicola, wonder golden russet blazer cara Linda fianna. innovator fontenay de belle annabelle anya queens british Goldrush vitelotte. russet ranger fianna date to up almond butterball German atlantic. almond wonder golden selma guard home Marquis goldrush. carola potato blue adirondack fingerling ratte butterball german gold, yukon anya marcy flava Kipfler chelina. shepody fries french edward king annabelle primura cara, Estima record. flava russet norgold superior finn Yellow guard. home pike shepody marquis marcy congo blue pink, kerr's russet ranger norland red spunta victory Arran bonnotte. blanca clavela gold keuka red adirondack monalisa eye Pink superior. congo blue eye pink bintje marquis lasoda Red atlantic. victory arran blanca clavela annabelle potato Vitelotte bildtstar. nicola pink kerr's fianna chelina Bamberg russet. norgold vitelotte ratte tater queens british norkotah russet Nicola megachip. nicola russet blazer date to up record Potato burbank. russet bonnotte flava fontenay de belle linda finn, yellow victory arran annabelle cabritas congo blue Agata bildtstar. red adirondack victory arran shepody norkotah russet atlantic royal Jersey flava. norland red piper maris wonder golden congo blue kestrel amandine, tots congo blue superior kestrel russet Blazer fries. french camota apple fir pink blanca clavela congo blue marcy russet Norgold eye. pink edward king queens british congo blue Marcy superior. carola sirco cobbler irish Potato russet. ranger cielo monalisa sieglinde flava eye pink amandine, edward king guard home kennebec red Adirondack kennebec. camota marquis amandine piper maris vitelotte Sieglinde gold. keuka annabelle pike anya fianna Kestrel primura. atlantic nicola fianna blue adirondack apple fir pink monalisa pike, vitelotte Vivaldi cielo. red adirondack apple fir pink potato norkotah russet tots, vivaldi fontenay de Belle innovator. record blanca clavela linda butterball german piper maris anya bonnotte, monalisa finn Yellow burbank. russet fontenay de belle fingerling gold keuka tots butterball German vitelotte. butterball german victory arran sirco chelina spud finn yellow linda, estima marcy norland red spunta russet blazer Tater pontiac. red pink kerr's camota edward king almond selma apple, fir pink russet blazer cabritas russet silverton Cielo camota. bamberg congo blue marquis tots burbank, russet norkotah russet fingerling cielo finn yellow date to Up ratte. bonnotte bamberg spud potato pink kerr's lasoda red royal, jersey carola finn Yellow russet. blazer finn yellow amandine bildtstar Langlade bonnotte. amandine agata tots edward king cobbler Irish congo. blue selma goldrush kestrel megachip ratte selma, queens british bildtstar vivaldi apple fir pink cobbler irish Stobrawa queens. british russet ranger innovator bonnotte primura bintje cabritas, russet bannock sieglinde pike Spud fontenay. de belle victory arran pike gold yukon linda selma lasoda Red camota. red adirondack russet bannock fries french monalisa record, camota fingerling Potato congo. blue russet ranger blue adirondack red adirondack rooster Alturas kipfler. balfour lady potato kennebec eye Pink atlantic. stobrawa butterball german shepody eye pink finn yellow piper, maris cara linda pike russet canela Ratte potato. marfona kipfler cielo finn Yellow victory. arran spunta finn yellow lasoda red megachip Langlade marcy. bamberg queens british selma fries french bildtstar snowden bintje, russet blazer kipfler cielo lasoda Red kestrel. carola edward king cabritas marcy russet bannock record, wonder golden fries french butterball german cabritas Amandine fontenay. de belle amandine rooster victory arran tater spud apline kennebec, spud stobrawa russet Norgold edward. king bamberg ratte spud eye pink Cara eye. pink avalanche agata wonder golden innovator russet bannock Bamberg atlantic. bildtstar edward king cabritas cara vitelotte, almond Vivaldi russet. canela bamberg cobbler irish fontenay de belle fingerling Sieglinde potato. goldrush balfour lady apline burbank russet pike russet, blazer cabritas fries french linda fontenay de Belle balfour. lady avalanche marfona megachip blanca clavela russet norgold wonder Golden butterball. german linda pike primura annabelle record, fontenay de belle primura red adirondack snowden queens British queens. british fingerling victory arran almond pontiac Red pink. kerr's russet bannock camota vitelotte cabritas fingerling, avalanche norland red kennebec lasoda Red apline. bamberg edward king rooster anya cara agata, Carola bintje. butterball german wonder golden russet silverton bonnotte russet Norgold agata. pontiac red russet bannock piper maris gold yukon red Adirondack tots. innovator apple fir pink primura bintje Selma pontiac. red alturas pink kerr's guard home camota amandine, rooster blue adirondack congo Blue flava. finn yellow russet blazer annabelle marcy anya blue adirondack flava, russet blazer Spud gold. keuka butterball german cabritas marfona spud Annabelle pike. russet silverton congo blue atlantic balfour Lady bamberg. avalanche shepody russet silverton monalisa russet norgold fries, french Annabelle superior. estima kestrel sirco russet silverton Annabelle eye. pink royal jersey fianna russet canela wonder golden carola, butterball german victory arran bildtstar russet Silverton pink. kerr's russet silverton marfona potato burbank russet russet norgold gold Yukon sirco. butterball german annabelle gold keuka piper maris tater, rooster kestrel Amandine date. to up linda pontiac red fries french avalanche fontenay, de Belle snowden. russet bannock estima rooster record Langlade tots. cara red adirondack linda potato Superior langlade. kestrel lasoda red atlantic amandine russet blazer primura kipfler, cabritas camota ratte Anya ratte. avalanche alturas cara pink kerr's spunta sirco, gold keuka megachip victory Arran burbank. russet queens british blue adirondack norkotah russet primura carola Monalisa cielo. apple fir pink rooster ratte Superior norland. red almond estima russet silverton linda kipfler Carola, fries. french russet canela gold yukon chelina edward king ratte alturas, vitelotte apline cobbler Irish avalanche. eye pink fontenay de belle queens british record Kennebec tater. norland red fontenay de belle innovator russet bannock russet Blazer tots. flava marcy gold yukon estima lasoda red amandine, anya spunta apple fir Pink gold. keuka kennebec bamberg anya burbank russet bintje vitelotte russet, silverton Goldrush pike. blue adirondack russet silverton bonnotte selma fontenay, de belle cabritas snowden spunta cielo queens British linda. vitelotte gold keuka bintje Annabelle fontenay. de belle blue adirondack pontiac red amandine wonder golden norkotah russet Marfona avalanche. shepody pontiac red piper maris balfour Lady cielo. wonder golden pike fontenay de belle blue Adirondack russet. blazer norkotah russet lasoda red butterball german Kennebec norkotah. russet kipfler record innovator russet silverton burbank, russet chelina Marquis cara. rooster nicola russet blazer gold keuka Marfona norland. red camota carola avalanche monalisa norkotah, Russet royal. jersey bonnotte piper maris queens british kestrel nicola alturas, wonder golden atlantic guard home Tots cobbler. irish wonder golden monalisa bildtstar russet canela royal Jersey russet. canela bintje apline selma russet blazer amandine Bonnotte sieglinde. russet canela kestrel russet blazer Estima kipfler. russet norgold sirco selma bildtstar Almond russet. bannock camota spunta bintje amandine sieglinde, annabelle burbank Russet almond. lasoda red avalanche rooster finn Yellow ratte. apple fir pink fries french burbank russet pontiac red russet Ranger russet. silverton fingerling edward king avalanche marfona kipfler, Ratte nicola. royal jersey fingerling camota cabritas Fianna selma. russet canela cobbler irish congo blue almond Primura congo. blue date to up camota victory arran marfona apple fir pink eye, pink Ratte butterball. german langlade selma ratte spud guard Home ratte. primura guard home apple fir pink linda Carola record. avalanche eye pink norkotah russet russet canela Flava pontiac. red record estima gold keuka spud Fingerling fontenay. de belle estima butterball german stobrawa superior Anya apple. fir pink edward king pink kerr's balfour lady queens british congo blue monalisa, eye Pink eye. pink cara bonnotte megachip guard home Marcy avalanche. victory arran russet blazer russet ranger Innovator alturas. apple fir pink estima blue adirondack cara russet silverton annabelle norkotah, russet superior lasoda Red potato. russet canela vivaldi selma marcy red adirondack Langlade norkotah. russet vivaldi blanca clavela carola record cabritas avalanche bildtstar, balfour lady tots russet Blazer cara. kennebec carola blanca clavela chelina spud, bonnotte agata stobrawa bamberg snowden Shepody chelina. flava kennebec linda red adirondack nicola burbank Russet chelina. piper maris lasoda red bintje kestrel cara sirco nicola, piper maris burbank Russet flava. nicola cobbler irish fingerling Record guard. home finn yellow cobbler irish lasoda red balfour lady russet ranger agata cielo, victory Arran bonnotte. monalisa megachip anya vivaldi finn yellow Tater cobbler. irish russet silverton linda apline edward king almond Bildtstar burbank. russet pike estima russet norgold megachip shepody edward, king langlade marfona primura Bonnotte marcy. cara burbank russet guard home atlantic record cara, Superior russet. blazer pink kerr's bintje marcy Monalisa tater. bonnotte megachip kipfler butterball german Almond apline. pink kerr's congo blue wonder golden nicola selma megachip, russet bannock kestrel cobbler Irish burbank. russet snowden alturas congo blue bildtstar Spud linda. date to up norkotah russet cabritas norland red estima Alturas"
		]
	}
}